---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericErrorNone
source: html/163ce66d-2424-489e-2299-df726fbdc6ae.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericErrorNone Property

None.

## Syntax (C#)
```csharp
public static FailureDefinitionId GenericErrorNone { get; }
```